{"/about/":{"data":{"":"","apa-yang-bisa-anda-temukan#Apa yang Bisa Anda Temukan?":"Di Nancynesia, Anda akan menemukan:\nPanduan dan Tutorial: Langkah demi langkah untuk memahami berbagai topik terkait cybersecurity. Catatan Kursus dan Pengalaman: Berbagi pengalaman pribadi dan pembelajaran yang diperoleh dari kursus dan pelatihan. Tips dan Best Practices: Strategi dan saran untuk meningkatkan keterampilan di bidang keamanan siber. Materi Pendidikan Gratis: Semua informasi disediakan tanpa biaya, dengan tujuan mengakses pengetahuan tanpa hambatan finansial. Semoga informasi yang ada di Nancynesia dapat bermanfaat bagi semua pengunjung dan berkontribusi pada ekosistem keamanan siber yang lebih aman dan beretika.","credits#Credits":"Nancynesia tidak bisa dibuat tanpa alat dan inspirasi berikut:\nHugo Tailwind CSS Heroicons Nextra Next.js Hextra ","mengapa-nancynesia#Mengapa Nancynesia?":"Nancynesia dibuat dengan semangat untuk membagikan pengetahuan kepada masyarakat luas. Nama “Nancynesia” sendiri diharapkan dapat mencerminkan kekuatan kolaborasi di bidang keamanan siber di Indonesia. Melalui web ini, saya berharap dapat menjadi sumber informasi terpercaya yang membantu banyak orang memahami tantangan dan solusi di dunia cybersecurity.","tentang-nancynesia#Tentang Nancynesia":"Nancynesia, singkatan dari Keamanan Cyber Indonesia, merupakan platform yang dibuat untuk berbagi ilmu dan pengalaman seputar keamanan siber. Web ini lahir dari catatan pribadi saya yang diperoleh saat mengikuti kursus, menonton video, dan membaca berbagai artikel. Tujuan utama Nancynesia adalah untuk memberikan akses ke informasi berkualitas tanpa biaya, sehingga siapa pun dapat mempelajari dan memahami aspek-aspek penting dalam dunia cybersecurity tanpa perlu mengikuti kursus berbayar.","visi-dan-misi#Visi dan Misi":"Dengan Nancynesia, saya ingin membantu menghilangkan hambatan dalam belajar keamanan siber dan memberikan kesempatan yang sama bagi semua orang untuk mengembangkan keterampilan mereka. Semua materi yang tersedia di web ini disediakan secara gratis sebagai bentuk dedikasi untuk berbagi pengetahuan. Saya percaya bahwa dengan berbagi, kita bisa menciptakan komunitas yang lebih kuat dan saling mendukung.\nNamun, saya ingin menegaskan bahwa semua informasi ini harus digunakan untuk tujuan positif. Hacking untuk tujuan buruk adalah kejahatan yang harus dihindari, gunakan ilmu yang dipelajari untuk kebaikan, bukan untuk merugikan orang lain. Dengan memahami dan menerapkan prinsip etika, kita bisa memastikan bahwa keamanan siber tetap menjadi bidang yang melindungi, bukan merusak."},"title":"About Me"},"/blog/hands-on_setup_lab_dan_lingkungan_testing_aman/":{"data":{"":"Menjelaskan bagaimana cara setup Lab yang baik, referensi dari course ITTS Ethical Hackers\nTags: [[hacking_fundamentals]]","1-memahami-komponen-utama#1. Memahami Komponen Utama":" Ubuntu 24.04: Digunakan sebagai OS utama untuk host karena stabilitas dan fleksibilitasnya. Kali Linux 2024.3: Sebagai distro khusus pengujian penetrasi dengan beragam tools bawaan. GNS3: Emulator jaringan untuk membangun topologi kompleks dan simulasi serangan/pertahanan. ","2-langkah-langkah-setup#2. Langkah-langkah Setup":"i. Instalasi Ubuntu 24.04\rUnduh ISO dari situs resmi Ubuntu. Buat media bootable (USB atau DVD) dan instal Ubuntu pada perangkat keras Anda. ii. Instalasi Kali Linux (Opsional)\rUnduh ISO Kali Linux 2024.3 dari situs resmi. Instal pada VM menggunakan software virtualisasi seperti VirtualBox atau VMware. iii. Instalasi GNS3\rUnduh dan instal GNS3 dari situs resminya. Konfigurasikan agar GNS3 dapat bekerja dengan VM Anda (misalnya untuk menghubungkan Kali Linux di dalam VM). iv. Konfigurasi Jaringan\rPastikan mesin host dan VM dapat berkomunikasi. Stabilkan koneksi internet untuk mengunduh tools dan update. v. Instalasi Tools\rDi Kali Linux: Sebagian besar tools untuk ethical hacking sudah tersedia secara default. Di Ubuntu: Instal tools melalui apt, seperti: Nmap: Untuk pemindaian jaringan. Metasploit: Framework eksploitasi. Wireshark: Analisis lalu lintas jaringan. John the Ripper: Cracking password. Burp Suite: Pengujian aplikasi web. vi. Membangun Topologi Jaringan di GNS3\rTambahkan perangkat jaringan seperti router, switch, firewall di GNS3. Konfigurasikan perangkat dan hubungkan sesuai kebutuhan topologi. ","3-contoh-topologi-sederhana#3. Contoh Topologi Sederhana":" Host: Kali Linux (mesin attacker). Target: Ubuntu Server (mesin target). Router: Mikrotik di GNS3. Switch: Built-in switch di GNS3. ","4-lingkungan-testing-aman#4. Lingkungan Testing Aman":" Isolasi Jaringan: Pisahkan dari jaringan produksi. Firewall: Batasi akses ke layanan tertentu. IDS (Intrusion Detection System): Pantau aktivitas jaringan. Virtualisasi: Isolasi setiap eksperimen untuk meminimalkan risiko. Backup: Lakukan backup secara berkala. ","5-hands-on-aktivitas#5. Hands-On Aktivitas":" Scanning Jaringan: Gunakan Nmap untuk memindai dan mengidentifikasi perangkat. Eksploitasi Kerentanan: Gunakan Metasploit pada kerentanan yang ditemukan. Analisis Traffic: Gunakan Wireshark untuk melihat pola traffic. Password Cracking: Gunakan John the Ripper. Web Application Hacking: Uji aplikasi web menggunakan Burp Suite. ","6-tips-tambahan#6. Tips Tambahan":" Pelajari Dasar-Dasar Jaringan untuk memahami lebih baik. Ikuti Tutorial dan Dokumentasi terkait tools yang digunakan. Praktikkan Secara Teratur untuk meningkatkan keterampilan. Etika: Selalu patuhi hukum dan prinsip ethical hacking. ","7-penting#7. Penting":" Jangan menyerang sistem tanpa izin. Patuhi kebijakan keamanan yang berlaku. "},"title":"Hands-on Setup Lab dan Lingkungan Testing Aman"},"/blog/markdown/":{"data":{"":"This article offers a sample of basic Markdown syntax that can be used in Hugo content files.","basic-syntax#Basic Syntax":"Headings\r# Heading 1 ## Heading 2 ### Heading 3 #### Heading 4 ##### Heading 5 ###### Heading 6","heading-2#Heading 2":"Heading 3\rHeading 4\rHeading 5\rHeading 6\rEmphasis\r*This text will be italic* _This will also be italic_ **This text will be bold** __This will also be bold__ _You **can** combine them_\rThis text will be italic\nThis will also be italic\nThis text will be bold\nThis will also be bold\nYou can combine them\nLists\rUnordered\r* Item 1 * Item 2 * Item 2a * Item 2b\rItem 1 Item 2 Item 2a Item 2b Ordered\r1. Item 1 2. Item 2 3. Item 3 1. Item 3a 2. Item 3b\rImages\r![GitHub Logo](https://github.githubassets.com/images/modules/logos_page/GitHub-Mark.png)\rLinks\r[Hugo](https://gohugo.io)\rHugo\nBlockquotes\rAs Newton said: \u003e If I have seen further it is by standing on the shoulders of Giants.\rIf I have seen further it is by standing on the shoulders of Giants.\nInline Code\rInline `code` has `back-ticks around` it.\rInline code has back-ticks around it.\nCode Blocks\rSyntax Highlighting\r```go func main() { fmt.Println(\"Hello World\") } ```\rfunc main() { fmt.Println(\"Hello World\") }\rTables\r| Syntax | Description | | --------- | ----------- | | Header | Title | | Paragraph | Text |\rSyntax Description Header Title Paragraph Text ","references#References":" Markdown Syntax Hugo Markdown "},"title":"Markdown Syntax Guide"},"/docs/":{"data":{"":"Di sini, Anda akan menemukan berbagai catatan, panduan, dan tutorial yang saya tulis untuk membantu Anda memahami berbagai topik teknologi. Dari cybersecurity hingga pemrograman dan pengembangan keterampilan lainya.\nCodingBelajar dan eksplorasi dunia pemrograman. HackingPanduan mendalam untuk cybersecurity dan ethical hacking. LifestyleCatatan seputar gaya hidup yang inspiratif dan produktif. LifehackTrik dan tips untuk meningkatkan efisiensi dan kualitas hidup. "},"title":"Notes"},"/docs/coding/":{"data":{"":"Selamat datang di halaman Coding! Di sini Anda akan menemukan berbagai catatan, panduan, dan tutorial seputar pemrograman. Dari pengembangan aplikasi hingga pengelolaan basis data, halaman ini dirancang untuk membantu Anda mendalami berbagai topik coding.","daftar-isi#Daftar Isi":" android_projects android_studio_jetpack_compose coding_tools computational devops_fundamentals java_oop mysql php_oop python_fundamentals "},"title":"Coding"},"/docs/coding/python_fundamentals/":{"data":{"":"Halaman ini mencakup dasar-dasar bahasa pemrograman Python. Anda akan menemukan panduan, contoh, dan tutorial sederhana yang dirancang untuk membantu pemula memahami konsep utama Python.","daftar-isi#Daftar Isi":" Python Hello World "},"title":"Python Fundamental"},"/docs/coding/python_fundamentals/python_hello_world/":{"data":{"":"","hello-world#Hello World!":"The “Hello World!” is a simple program that outputs Hello World! to the screen.\nIn Python, we use print() to show words on the screen. The words go inside quotation marks.\nLet’s take a look at the “Hello World!” program in Python:\nprint(\"Hello World!\")","introduction#Introduction":"Python is one of the world’s easiest and most popular programming languages. This course will teach you the basics of Python, without requiring any prior knowledge.\nhello.pyprint(\"Hello Python!\")"},"title":"Python Hello World"}}